backend/app/controllers/jokes_controller.rb

UPDATE `jokes` SET `jokes`.`like` = COALESCE(`jokes`.`like`, 0) + 1 WHERE `jokes`.`id` = 1
---
  def like
    @joke&.increment!(:like)

UPDATE `jokes` SET `jokes`.`dislike` = COALESCE(`jokes`.`dislike`, 0) + 1 WHERE `jokes`.`id` = 2
---
  def dislike
    @joke&.increment!(:dislike)

SELECT `jokes`.* FROM `jokes` WHERE `jokes`.`id` = 2 LIMIT 1
---
  def find_joke
    @joke = Joke.find_by_id(params[:id])

SELECT `jokes`.* FROM `jokes` ORDER BY `jokes`.`id` ASC LIMIT 1 OFFSET 1
---
  def set_joke
    jokes_voted = cookies[:jokes].split(',').map(&:to_i) if cookies[:jokes]